---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeFailedNotOnlyLines
source: html/c13ea66e-04ca-1d92-bf02-d50f41f5ccb0.htm
---
# Autodesk.Revit.DB.BuiltInFailures.SlabShapeFailures.SlabShapeFailedNotOnlyLines Property

The Floor or Roof or Toposolid may only contain straight lines.

## Syntax (C#)
```csharp
public static FailureDefinitionId SlabShapeFailedNotOnlyLines { get; }
```